<?php

    $user = [
        "name" => "Руслан",
        "age" => 30,
        "city" => "Москва",
        "email" => "bagovrusl@gmail.com"
    ];

    //вывод всего массива
    echo "Информация о пользователе:\n";
    print_r($user) . "\n";

    echo "----------------------------------------\n";

    //вывод имени пользователя и возраста
    echo $user['name'] . "\n";
    echo $user['age'] . "\n";

    echo "----------------------------------------\n";

    //изменение города в массиве и добавление элемента в массив
    //удаление элемента из массива
    echo "Обновлённая информация о пользователе:\n";
    $user['city'] = 'Омск';
    $user += ["role" => "developer"];
    unset ($user['email']);
    print_r($user) . "\n";
?>