<?php

    // ЗАДАНИЕ 1    

    $str = 'PHP — язык программирования';

    echo "\n {$str}"; // вывести строку
    echo "\n " . strlen($str); // вывести длину строки
    echo "\n " . mb_strlen($str); // Вывести длину той же строки с помощью функции, предназначенной для корректной работы с многобайтными кодировками.
                                  // в UTF-8 русские буквы занимают 2 байта, а длинное — 3 байта, именно по этому в strlen()
                                  // выводится 49. В случае с mb_strlen() идёт подсчёт именно символов 
    echo "\n --------------------------------------------------------------------------";

    // ЗАДАНИЕ 2

    $hello = 'Hello';
    $helloRus = 'Привет';

    echo "\n Строка: {$hello}";
    echo "\n Обычная длина: " . strlen($helloRus); // strlen() → количество байт
    echo "\n UTF-8 длина: " . mb_strlen($hello); // mb_strlen() → количество символов

    echo "\n Строка: {$helloRus}";
    echo "\n Обычная длина: " . strlen($helloRus);
    echo "\n UTF-8 длина: " . mb_strlen($helloRus);

    echo "\n --------------------------------------------------------------------------";

    // МИНИ ЗАДАЧА

    $name = 'Руслан';
    $surname = 'Багов';
    $fullName = "{$name} {$surname}";
    $length = mb_strlen($fullName, 'UTF-8');
    
    echo "\n " . mb_substr($fullName, 0, mb_strpos($fullName, ' '), 'UTF-8'); // выводит только имя
    echo "\n Длина строки: {$length} символов";

    if ($length > 10) {
        echo "\n Строка длиннее 10 символов!";
    }
?>