<?php

    for ($i = 1; $i < 11; $i++):
        if ($i == 5){
            echo "\n Заказ №$i — найден!";
        } else {
            echo "\n Заказ №$i";
        }
    endfor;

    echo "\n ---------------------------------------------------";

    $i = 0;
    while($i < 10) {
        $i++;
        if ($i % 2) {
            echo "\n $i";
        } else {
            continue;
        }
    }

    echo "\n ---------------------------------------------------";

    $i = 1;
    do {
        if ($i == 5){
            echo "\n $i";
            break;
        } else {
            echo "\n $i";
        }
    } while (++$i <= 5);

    echo "\n ---------------------------------------------------";

    $i = 0;
    $j = 0;
    while ($i < 2) {
        ++$i;
        echo "\n Товар №$i";
        while ($j < 3) {
            ++$j;
            echo "\n    Вариант №$j";
        }
        $j = 0;
    }

    echo "\n ---------------------------------------------------";

    for ($i = 1; $i <= 2; $i++):
        echo "\n Товар №$i";
        for ($j = 1; $j <= 3; $j++):
            echo "\n    Вариант №$j";
        endfor;
    endfor;


?>      

