<?php

    $price = 2500;
    $quantity = 3;
    $discount = 10;

    echo "\n Цена: ", $price, "\n Количество: ", $quantity, "\n Скидка: ", $discount, "%\n Стоимость без скидки: ", $price * $quantity, "\n Размер скидки: ", ($price * $quantity) * ($discount / 100), "\n Итоговая стоимость: ", ($price * $quantity) - (($price * $quantity) * ($discount / 100)), "\n --------------------------------------------------------------------------";
    ++$quantity;
    echo "\n Цена: ", $price, "\n Количество: ", $quantity, "\n Скидка: ", $discount, "%\n Стоимость без скидки: ", $price * $quantity, "\n Размер скидки: ", ($price * $quantity) * ($discount / 100), "\n Итоговая стоимость: ", ($price * $quantity) - (($price * $quantity) * ($discount / 100)), "\n --------------------------------------------------------------------------";

    if ($price > 2000) echo PHP_EOL . ' Цена больше двух тысяч!';
    if ($quantity == 4) echo PHP_EOL . ' Количество равно четырём!';
    if ($price === 2500) echo PHP_EOL . ' Цена эквивалента 2500!';

    $result = ($price * $quantity) - (($price * $quantity) * $discount / 100); // скобочки тут для приоритета вычисления как в обычной математике
    $result = $price <=> 2000;
    echo "\n " . "Результат сравнения: " . $result;

    $a = 12;
    $b = 10;

    echo "\n ------------------------------------------------------------------------------\n";
    
    echo "\n {$a} & {$b} = " . ($a & $b); 
    //То есть & сравнивает биты попарно:
    //  1 1 0 0
    //& 1 0 1 0
    //---------  1000 в десятичной системе = 8.
    //  1 0 0 0
    echo "\n {$a} | {$b} = " . ($a | $b);
    //А | работает иначе
    //  1 1 0 0
    //| 1 0 1 0
    //--------- 1110 в десятичной системе = 14.
    //  1 1 1 0
    echo "\n {$a} ^ {$b} = " . ($a ^ $b);
    //^ даёт 1, если биты разные:
    //  1 1 0 0
    //^ 1 0 1 0
    //--------- 0110 в десятичной системе = 6.
    //  0 1 1 0

    echo "\n {$a} в двоичном виде: " . decbin($a);
    echo "\n {$b} в двоичном виде: " . decbin($b); 
?> 