<?php

    $orderCount = 5;
    $e = 0;

    for ($i = 1; $i <= $orderCount; $i++) {
        echo "Обработка заказа №$i\n";

        if ($i === 3) {
            echo "Заказ №$i требует проверки\n";
            continue;
        }

        if ($i === 5) {
            echo "Последний заказ обработан\n";
            break;
        }
    }

    echo "----------------------------------------\n";

    do {
       
        $e++;
        echo "Обработка заказа №$e\n";
        
        if ($e === 3) {
            echo "Заказ №$e требует проверки\n";
            continue;
        }

        if ($e === 5) {
            echo "Последний заказ обработан\n";
        }
    } while ($e < $orderCount);

    echo "----------------------------------------\n";

    $e = 0;

    while (true) {

        $e++;
        echo "Обработка заказа №$e\n";

        if ($e === 3) {
            echo "Заказ №$e требует проверки\n";
            continue;
        }

        if ($e === 5) {
            echo "Последний заказ обработан\n";
            break;
        }
    }


?>