<?php

    $products = [
        "Наушники",
        "Клавиатура",
        "Мышь",
        "Монитор"
    ];

    //вывод всего массива
    echo "Список продуктов:\n";
    
    print_r($products);
    

    echo "----------------------------------------\n";

    //вывод 1 элемента массива
    echo "Первый продукт:\n $products[0]\n";

    echo "----------------------------------------\n";

    //вывод последнего элемента массива
    echo "Последний продукт:\n $products[3]\n";

    echo "----------------------------------------\n";

    //добавление изменений элемента в массив и добавление нового элемента в массив
    $products[3] = "Веб-камера";
    $products[4] = "Микрофон";
    echo "Обновленный список продуктов:\n";
    print_r($products);

    echo "----------------------------------------\n";

    //удаление элемента из массива
    $productCount = count($products);
    unset($products[$productCount - 1]);
    echo "Список продуктов после удаления элемента:\n";
    print_r($products);

    echo "----------------------------------------\n";

    //вывод количества элементов в массиве
    $productCount = count($products);
    echo "Количество продуктов в массиве: $productCount\n";
?>