<?php

    $dir = opendir(__DIR__); //открываем каталог

    while (($e = readdir($dir)) !== false) { // цикл проходится по каждому файлу и каталогу в нашем каталоге и когда доходит до конца он прекращается.
        if ($e === '.' || $e === '..') { // исключаем из выводы текущий каталог . и родительский .. 
            continue;
        }

        if (is_dir(__DIR__ . "/{$e}")) { // если прочитанное имя в каталоге является существующим каталогом 
            echo "Каталог: {$e}" . PHP_EOL; // мы выводим что это каталог
        } else {
            echo "Файл: {$e}" . PHP_EOL; // иначе это может быть только файл
        }
    }

    closedir($dir); // закрываем каталог после работы


?>