<?php

    function scanDirectory($path) { // функция рекурсии которая пройдётся по всем файлам и каталогам и даже каталогам внутри других каталогов
        $dir = opendir($path); // открываем каталог по указанному пути $path
        while (($b = readdir($dir)) !== false) { // проходится по каждому элементу внутри указанного каталога

            $fullPath = $path . '/' . $b; // полный путь до файла который меняется с каждым уровнем глубины 

            if ($b === '.' || $b === '..') { // исключаем из выводы текущий каталог . и родительский .. иначе будет бесконечный цикл
                continue;
            }

            if (is_dir($fullPath)) {
                echo "Каталог: {$fullPath}" . PHP_EOL; // если найден каталог мы выводим его и входим в него с помощью вызова этой же функции
                scanDirectory($fullPath); // функция вызывает сама себя это корень рекурсии
            } else {
                echo "Файл: {$fullPath}" . PHP_EOL;
            }
        }   

        closedir($dir); // закрываем каталоги
   }

   scanDirectory(__DIR__); // вызываем функцию для рекурсии по всем файлам в папке этого кода

?>